Revit 2027 API
RebarSpliceUtils.SpliceRebar(Document, ElementId, RebarSpliceOptions, IList<RebarSpliceGeometry>) Method
 Splice a rebar with a list of RebarSpliceGeometry.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> SpliceRebar(
	Document document,
	ElementId rebarIdToSplice,
	RebarSpliceOptions spliceOptions,
	IList<RebarSpliceGeometry> spliceGeometries
)
Public Shared Function SpliceRebar (
	document As Document,
	rebarIdToSplice As ElementId,
	spliceOptions As RebarSpliceOptions,
	spliceGeometries As IList(Of RebarSpliceGeometry)
) As IList(Of ElementId)
public:
static IList<ElementId^>^ SpliceRebar(
	Document^ document,
	ElementId^ rebarIdToSplice,
	RebarSpliceOptions^ spliceOptions,
	IList<RebarSpliceGeometry^>^ spliceGeometries
)
static member SpliceRebar :
        document : Document *
        rebarIdToSplice : ElementId *
        spliceOptions : RebarSpliceOptions *
        spliceGeometries : IList<RebarSpliceGeometry> -> IList<ElementId>
Parameters
document Document
 The document
rebarIdToSplice ElementId
 Rebar id to splice.
spliceOptions RebarSpliceOptions
 The rebar splice options.
spliceGeometries IList<RebarSpliceGeometry>
 A list of RebarSpliceGeometry that indicates where the rebar will be spliced.
Return Value
IList<ElementId>
 Returns the ids of the rebars that are considered to be spliced.
Exceptions
Exception | Condition
ArgumentException |  Free Form Rebars other than Morphed, or Shape Driven Rebars that are Multiplanar or have a shape whose definition is RebarShapeDefinitionByArc can't be spliced. Also, if the Rebar is member of a Group it cannot be spliced.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarSpliceUtils Class
SpliceRebar Overload
Autodesk.Revit.DB.Structure Namespace